In [2]:
mi_lista=list(range(0,20))
mi_lista

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [3]:
import pandas as pd
import numpy as np

In [4]:
serie_1=pd.Series(mi_lista,dtype=float)
serie_1

0      0.0
1      1.0
2      2.0
3      3.0
4      4.0
5      5.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
11    11.0
12    12.0
13    13.0
14    14.0
15    15.0
16    16.0
17    17.0
18    18.0
19    19.0
dtype: float64

In [5]:
mi_dic={'rodrigo':7,'david':8,'daniela':6,'ravi':10}
mi_dic

{'rodrigo': 7, 'david': 8, 'daniela': 6, 'ravi': 10}

In [6]:
serie_2=pd.Series(mi_dic)
serie_2["Rodrigo"] ==serie_2[0]
#True

KeyError: 'Rodrigo'

In [ ]:
serie_2

rodrigo     7
david       8
daniela     6
ravi       10
dtype: int64

In [ ]:
serie_2.size

4

In [ ]:
serie_1.count(),serie_1.sum(),serie_1.info(),serie_1.cumsum()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: None
Non-Null Count  Dtype
--------------  -----
20 non-null     float64
dtypes: float64(1)
memory usage: 288.0 bytes

(20,
 190.0,
 None,
 0       0.0
 1       1.0
 2       3.0
 3       6.0
 4      10.0
 5      15.0
 6      21.0
 7      28.0
 8      36.0
 9      45.0
 10     55.0
 11     66.0
 12     78.0
 13     91.0
 14    105.0
 15    120.0
 16    136.0
 17    153.0
 18    171.0
 19    190.0
 dtype: float64)

In [ ]:
serie_1.describe()

count    20.00000
mean      9.50000
std       5.91608
min       0.00000
25%       4.75000
50%       9.50000
75%      14.25000
max      19.00000
dtype: float64

In [ ]:
serie_1.apply(int).apply(np.sqrt)

0     0.000000
1     1.000000
2     1.414214
3     1.732051
4     2.000000
5     2.236068
6     2.449490
7     2.645751
8     2.828427
9     3.000000
10    3.162278
11    3.316625
12    3.464102
13    3.605551
14    3.741657
15    3.872983
16    4.000000
17    4.123106
18    4.242641
19    4.358899
dtype: float64

In [ ]:
mask=serie_2>5
serie_2[mask]

rodrigo     7
david       8
daniela     6
ravi       10
dtype: int64

In [ ]:
serie_4=pd.Series([None,4,3,None,10,20,None])
serie_4
serie_4.dropna().reset_index(drop=True)

0     4.0
1     3.0
2    10.0
3    20.0
dtype: float64

In [ ]:
serie_4.dropna()

0     NaN
1     4.0
2     3.0
3     NaN
4    10.0
5    20.0
6     NaN
dtype: float64

In [ ]:
mi_dic2={'alumnos':['ravi','daniel','daniela','justo','mateo'],'notas':[5,10,6,7,1],'edad':[20,30,45,10,23]}

In [ ]:
mi_dic2

{'alumnos': ['ravi', 'daniel', 'daniela', 'justo', 'mateo'],
 'notas': [5, 10, 6, 7, 1],
 'edad': [20, 30, 45, 10, 23]}

In [ ]:
df1=pd.DataFrame(mi_dic2,index=mi_dic2['alumnos']).drop('alumnos',axis=1)
df2=pd.DataFrame(mi_dic2)
df1

         notas  edad
ravi         5    20
daniel      10    30
daniela      6    45
justo        7    10
mateo        1    23

In [ ]:
df2

   alumnos  notas  edad
0     ravi      5    20
1   daniel     10    30
2  daniela      6    45
3    justo      7    10
4    mateo      1    23

In [ ]:
df1.sort_values('edad')

         notas  edad
justo        7    10
ravi         7    20
mateo        1    23
daniel      10    30
daniela      6    45

In [ ]:
prueba1=pd.DataFrame(serie_1,serie_2)
prueba1

       0
7    7.0
8    8.0
6    6.0
10  10.0

In [ ]:
df1.tail(2)

       notas  edad
justo      7    10
mateo      1    23

In [ ]:
import os
os.getcwd()

'c:\\Users\\gomez\\Desktop\\Henry\\Repos clases\\Clase 04'

In [ ]:
df4=pd.read_csv(r'C:\Users\gomez\Desktop\Henry\Repos clases\Clase 04\colesterol.csv',sep=";",decimal=',')
df4.head()

                         nombre  edad sexo  peso  altura  colesterol
0  José Luis Martínez Izquierdo    18    H  85.0    1.79       182.0
1                Rosa Díaz Díaz    32    M  65.0    1.73       232.0
2         Javier García Sánchez    24    H   NaN    1.81       191.0
3           Carmen López Pinzón    35    M  65.0    1.70       200.0
4          Marisa López Collado    46    M  51.0    1.58       148.0

In [ ]:
df4['peso']=pd.Series([1,2])
df4

                             nombre  edad sexo  peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   1.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   2.0    1.73       232.0
2             Javier García Sánchez    24    H   NaN    1.81       191.0
3               Carmen López Pinzón    35    M   NaN    1.70       200.0
4              Marisa López Collado    46    M   NaN    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   NaN    1.74       249.0
6           Antonio Fernández Ocaña    51    H   NaN    1.72       276.0
7             Pilar Martín González    22    M   NaN    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   NaN    1.94       241.0
9           Santiago Reillo Manzano    46    H   NaN    1.85       280.0
10            Macarena Álvarez Luna    53    M   NaN    1.62       262.0
11       José María de la Guía Sanz    58    H   NaN    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H   NaN    1.98       210.0
13            Carolina Rubio Moreno    20    M   NaN    1.77       194.0

In [ ]:
df4

                             nombre  edad sexo  altura  colesterol
0      José Luis Martínez Izquierdo    18    H    1.79       182.0
1                    Rosa Díaz Díaz    32    M    1.73       232.0
2             Javier García Sánchez    24    H    1.81       191.0
3               Carmen López Pinzón    35    M    1.70       200.0
4              Marisa López Collado    46    M    1.58       148.0
5                 Antonio Ruiz Cruz    68    H    1.74       249.0
6           Antonio Fernández Ocaña    51    H    1.72       276.0
7             Pilar Martín González    22    M    1.66         NaN
8              Pedro Gálvez Tenorio    35    H    1.94       241.0
9           Santiago Reillo Manzano    46    H    1.85       280.0
10            Macarena Álvarez Luna    53    M    1.62       262.0
11       José María de la Guía Sanz    58    H    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H    1.98       210.0
13            Carolina Rubio Moreno    20    M    1.77       194.0

In [ ]:
df4.iloc[3,0]

'Carmen López Pinzón'

In [ ]:
df4.loc[3][0]

'Carmen López Pinzón'

In [ ]:
df4.edad

0     18
1     32
2     24
3     35
4     46
5     68
6     51
7     22
8     35
9     46
10    53
11    58
12    27
13    20
Name: edad, dtype: int64

In [ ]:
df4.sexo.sum()

'HMHMMHHMHHMHHM'

In [ ]:
df4.groupby(['edad','altura']).groups

{(18, 1.79): [0], (20, 1.77): [13], (22, 1.66): [7], (24, 1.81): [2], (27, 1.98): [12], (32, 1.73): [1], (35, 1.7): [3], (35, 1.94): [8], (46, 1.58): [4], (46, 1.85): [9], (51, 1.72): [6], (53, 1.62): [10], (58, 1.87): [11], (68, 1.74): [5]}

In [8]:
titanic=pd.read_csv(r'C:\Users\gomez\Desktop\Henry\Repos clases\Clase 04\Titanic.csv')
titanic_copia=titanic.copy()

In [19]:
titanic.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [10]:
print(titanic.shape)
print(titanic.columns)

(891, 12)
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [16]:
print(titanic.isna().sum())
print(titanic.Cabin.isna().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
687

In [20]:
titanic.isna().sum(axis=0).idxmax()

'Cabin'

In [21]:
titanic.iloc[titanic.isna().sum(axis=1).idxmax()]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [22]:
titanic.iloc[titanic.Age.idxmax()]

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

In [24]:
titanic.iloc[titanic.Age.idxmax()]["Name"]

'Barkworth, Mr. Algernon Henry Wilson'

In [25]:
titanic.shape

(891, 12)

In [28]:
titanic_copia.dropna(inplace=True)
titanic_copia.shape

(183, 12)

In [29]:
titanic_copia=titanic.copy()

In [30]:
titanic_copia.dropna(axis=0,thresh=3,inplace=True)

In [31]:
titanic_copia.shape

(891, 12)

In [37]:
titanic_copia.dropna(axis=1,inplace=True,thresh=titanic_copia.shape[0]*0.5)

In [38]:
titanic_copia.shape

(891, 11)

In [39]:
print(titanic_copia.Age.mean())
print(titanic_copia.Age.mode())
print(titanic_copia.Age.median())
print(titanic_copia.Age.std())

29.69911764705882
0    24.0
Name: Age, dtype: float64
28.0
14.526497332334042

In [40]:
titanic_copia.fillna(titanic_copia.Age.median(),inplace=True)

In [41]:
print(titanic_copia.Age.mean())
print(titanic_copia.Age.mode())
print(titanic_copia.Age.median())
print(titanic_copia.Age.std())

29.36158249158249
0    28.0
Name: Age, dtype: float64
28.0
13.019696550973201